public class Messages {
    public final static String welcome = "Этот сервер создан для того чтобы улучшать свои скиллы, как софт так и хард \r\n\n" +
            "Здесь участники с ролью <@&1226647989674840116> помогают другим с их проблемами в каких-то аспектах программирования \r\n\n" +
            "<@&1226647989674840116> прокачивают свои софт скиллы, а остальным помогают прокачать свои харды\r\n" +
            "\nНадеемся на создание веселого коммьюнити которое будет взаимодействовать друг с другом и улучшать себя!\r\n\n" +
            "По вопросам касаемо программирования, сервера или жалоб обращаться к <@&1228405281424146452>";

    public final static String rules = "Список запрещенок: \r" +
            "\n1. Разжигание ненависти в любом виде" +
            "\n2. NSFW контент" +
            "\n3. Реклама, скам и прочие махинации";

    public final static String roles = "Нажмите на кнопку для получения роли:\r\n\n" +
            "Чтобы получить роль которая указывает \rваш курс в Хекслет колледже напишите <@&1228405281424146452>";

    public final static String howToUse = "Чтобы создать тикет с вашим вопросом, нужно будет нажать на кнопку ниже \r\n" +
            "с языком по которому у вас есть вопрос или проблема. \r\n\n" +
            "Так же стоит понимать что ответ на вопрос вы можете получить не сразу, и не совсем точный. \r\n" +
            "Как раз для этого и был создан сервер чтобы прокачивать софт скиллы и учиться объяснять. \r\n\n" +
            "Если вам не удалось получить ответ на свой вопрос, вы так же можете задать его открыто в <#1228579573172670515>";

    public final static String ticketMessageOpened = "Ваш созданный тикет, здесь вам необходима указать тему тикета.\r\n\n" +
            "В будущем этот тикет после завершения не будет удален, и останется в виде заметки с измененым названием на вашу тему\r\n\n" +
            "Напишите тему вашего вопроса \r\n(запишите для себя так чтобы могли в будущем сориентироваться что это за тикет!)\r\n\n" +
            "Пример ввода: Функция reduce\r\n\n" +
            "После этого нажмите на кнопку \"Изменить название\".\r\n" +
            "После закрытия тикета вы сможете писать, и менять название, но никто из <@&1226647989674840116> уже не увидит ваш тикет\r\n\n" +
            "Status: <@&1228395383659565206>";

    public final static String ticketMessageClosed = "Ваш созданный тикет, здесь вам необходима указать тему тикета.\r\n\n" +
            "В будущем этот тикет после завершения не будет удален, и останется в виде заметки с измененым названием на вашу тему\r\n\n" +
            "Напишите тему вашего вопроса \r\n(запишите для себя так чтобы могли в будущем сориентироваться что это за тикет!)\r\n\n" +
            "Пример ввода: Функция reduce\r\n\n" +
            "После этого нажмите на кнопку \"Изменить название\".\r\n" +
            "После закрытия тикета вы сможете писать, и менять название, но никто из <@&1226647989674840116> уже не увидит ваш тикет\r\n\n" +
            "Status: <@&1228468036370174005>";

    public final static String supporterRules = "1. Не влезать в чужой тикет без необходимости\r\n" +
            "2. Вести себя адекватно в тикете \r\n\n" +
            "Если есть еще какие-то вопросы пишите <@&1228405281424146452>";

    public final static String updatesMessage = "Здесь будут публиковаться обновления, описание добавленных/измененных функций";
}
